// Заголовочный файл библиотеки ввода-вывода,
// предназначенной для имитации ввода-вывода,
// используемого в симуляторе RARS

//------------------------------------------------------------------------------
// Вывод числа int на консоль RARS
// PrintInt  1 Prints an integer a0 = integer to print N/A
void PrintInt(int a0);

//------------------------------------------------------------------------------
// Чтение целого числа в консоли RARS
// ReadInt 5 Reads an int from input console N/A a0 = the int
int ReadInt();

//------------------------------------------------------------------------------
// Вывод символа на консоль RARS
// PrintChar  11 Prints an ascii character
// a0 = character to print (only lowest byte is considered)  N/A
void PrintChar(int a0);

//------------------------------------------------------------------------------
// Ввод целого числа с консоли RARS
int ReadInt();

//------------------------------------------------------------------------------
// Ввод числа float с консоли RARS
int ReadFloat();

//------------------------------------------------------------------------------
// Ввод числа double с консоли RARS
int ReadDouble();

//------------------------------------------------------------------------------
// Вывод числа float на консоль RARS
int PrintFloat();

//------------------------------------------------------------------------------
// Вывод числа double на консоль RARS
int PrintDouble();
